# Document New Zone Method

Source: https://www.revitapidocs.com/2026/a0731d97-81ba-be0b-b2df-48f55b06363a.htm

---

| Document New Zone Method |
| --- |

**Note: This API is now obsolete.**

Creates a new Zone element.
**Namespace:** Autodesk.Revit.Creation
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object instead.")]
public Zone NewZone(
	Level level,
	Phase phase
)
```

```
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object instead.")>
Public Function NewZone (
	level As Level,
	phase As Phase
) As Zone
```

```
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object instead.")]
Zone^ NewZone(
	Level^ level,
	Phase^ phase
)
```

```
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object instead.")>]
member NewZone :
        level : Level *
        phase : Phase -> Zone
```

#### Parameters

level Level
:   The level on which the Zone is to exist.

phase Phase
:   The associative phase on which the Zone is to exist.

#### Return Value

Zone
If successful a new Zone element within the project, otherwise . Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the specified parameter Value is . |
| InvalidOperationException | Thrown when the electrical system cannot be created by these input phase and level. |
| ArgumentException | Thrown if the level does not exist in the given document. |
| ArgumentException | Thrown if the phase does not exist in the given document. |

See Also

#### Reference

Document Class Autodesk.Revit.Creation Namespace